In [1]:
import  pandas as pd
import numpy as np

In [2]:
products = pd.read_csv('./course-files/northwind-mongo-master/products.csv', usecols =['ProductID','ProductName'])

In [3]:
orderedProducts = pd.read_csv('./course-files/northwind-mongo-master/order-details_del.csv',
                             usecols = ['OrderID','ProductID','UnitPrice','Quantity'])

In [4]:
products.head()

   ProductID                   ProductName
0          1                          Chai
1          2                         Chang
2          3                 Aniseed Syrup
3          4  Chef Anton's Cajun Seasoning
4          5        Chef Anton's Gumbo Mix

In [5]:
orderedProducts.head()

   OrderID  ProductID  UnitPrice  Quantity
0    10331         54        5.9        15
1    10332         18       50.0        40
2    10332         42       11.2        10
3    10332         47        7.6        16
4    10333         14       18.6        10

In [7]:
merged = products.merge(orderedProducts, on ='ProductID', how = 'left', indicator = True)

In [8]:
merged.head()

   ProductID ProductName  OrderID  UnitPrice  Quantity _merge
0          1        Chai  10348.0       14.4      15.0   both
1          1        Chai  10354.0       14.4      12.0   both
2          1        Chai  10370.0       14.4      15.0   both
3          1        Chai  10406.0       14.4      10.0   both
4          1        Chai  10413.0       14.4      24.0   both

In [9]:
merged['_merge'].value_counts()

both          289
left_only       5
right_only      0
Name: _merge, dtype: int64

In [10]:
merged = products.merge(orderedProducts, on ='ProductID', how = 'right', indicator = True)

In [11]:
merged.head()

   ProductID ProductName  OrderID  UnitPrice  Quantity _merge
0          1        Chai    10348       14.4        15   both
1          1        Chai    10354       14.4        12   both
2          1        Chai    10370       14.4        15   both
3          1        Chai    10406       14.4        10   both
4          1        Chai    10413       14.4        24   both

In [12]:
merged['_merge'].value_counts()

both          289
right_only      0
left_only       0
Name: _merge, dtype: int64

In [13]:
merged = orderedProducts.merge(products, on ='ProductID', how = 'right', indicator = True)

In [14]:
merged['_merge'].value_counts()

both          289
right_only      5
left_only       0
Name: _merge, dtype: int64

In [15]:
filter = merged['_merge'] =='right_only'
merged[filter]

,OrderID,ProductID,UnitPrice,Quantity,ProductName,_merge
289,NaN,6,NaN,NaN,Grandma's Boysenberry Spread,right_only
290,NaN,15,NaN,NaN,Genen Shouyu,right_only
291,NaN,27,NaN,NaN,Schoggi Schokolade,right_only
292,NaN,66,NaN,NaN,Louisiana Hot Spiced Okra,right_only
293,NaN,67,NaN,NaN,Laughing Lumberjack Lager,right_only